{
    "?help": "you can use ?<text> to interact with me.",
    "?hello": "Hello world! My name is Sherp. I am ~~a bot~~ inside your walls.",
    "?sharon": "Email csugrad@ualberta.ca.",
    "?health": "Yes, CD does work. Thanks for asking.",
    "?contribute": "My repo is here: <https://github.com/Sooraj-beep/sherp2.0>",

    "//": "copypasta shortcuts",
    "?ty": "I feel so passionate about how many ingenious minds exist on this server where we can share knowledge and experiences. There are not many places on the internet where you can expose your true self and be heard. Thank you all for existing 🥰",
    "?bias": "I don't have a strong negative bias about cs. First I don't think you should take everything you read as seriously as you do, text inherently lacks a breath of tone by nature so I don't think you should take it as a personal attack.\n\nSecond it isn't a negative bias to say the job prospects of a cs degrees is very limited compared to non cs disciples",
    "?break": "Good Afternoon Team,\n\nI am sending this message to let you know that I'm going to have to make an decrease in shitposting and :OnPhone: posting today. As you know I have a test today so instead of 1000+ shitposts at max productivity you guys might see up to 101 from me today. I hope this doesn't impact our relationship moving forward and I will do my best to stabilize my frequency.\n\nPlease let me know if you would like clarification on anything.\nThank you",
    "?pingu": "Couple weeks into scheming 101 now, doing well, already past nfts and get rich quick courses. Dropshipping was a joke. Garage sale flipping remain my specialty. I ask professor Pingu his thoughts on crypto and paid testing. He's impressed I know about the subject. We converse after class for some time, sharing scheming insights; I can keep up. He tells me of great things ahead like plasma donation and paid surveys. I tell him I already read about pumping and dumping in econ class. He is yet again impressed at my enthusiasm. What a joy it is to have your professor visibly brighten when he learns of your talents. And now I sit here wondering what it must be like to be a brainlet, unable to engage your professor as an intellectual peer. All of the deep conversations you people must miss out on because you aren't able to overcome the intellectual IQ barrier that stands in the way of your academic success... it's so sad. My professor and I know each other on first name basis now, but i call him Dr. out of respect. And yet here you brainlets sit, probably havent even made eye contact with yours out of fear that they will gauge your brainlet IQ levels. A true shame, but just know it is because i was born special that i am special. I can't help being a penguin, nor can my professor. Two of a kind is two flocks in a bush.",
    "?quit": "Guys, I'm sorry for meming all the time, I never have anything insightful to say and no one has ever found any of my jokes funny. I am gonna transition to readonly and exploring the other (simpler) things in life like origami and art. Wish me luck in creating some sweet art ",
    "?copypasta": "Listen up, you dumb fucks. I came to this godforsaken Discord server as a CS student, expecting some fucking help and connection with my fellow nerds. But what do I find? A cesspool of worthless copypasta and shitposts. Congratu-fucking-lations, you've turned this place into a dumpster fire. You morons can't stop jerking each other off with your shitty memes and nonsense. Meanwhile, people who actually want to learn something get shafted. Great fucking job, you inconsiderate assholes. I get it, you need to circlejerk and have a good laugh every now and then, but don't fuck up the whole purpose of the server. This place is supposed to help CS students, not be a breeding ground for your pathetic attempts at humor. Get your heads out of your asses and do something useful for once. Here's a novel idea: maybe the useless fuckwits who call themselves moderators can pull their thumbs out of their asses and actually moderate this shitshow. Make this place something other than a complete waste of time for everyone involved. Good fucking luck with that.",
    "?skill": "Skill Issue, don't take this post seriously. OP is taking a major he has no passion studying for or misunderstands what a degree in computer science means. This post should be deleted as it deters people from taking arguably one of the best majors offered on this campus. To anyone who's planning to take computer science, this is not an appropriate representation of what computer science on UofA is like. We have a very active faculty and very helpful and motivated professors and in me and my friends' past 3 years of taking about every CS course none of us have felt this way.",
    "?sad": "This server has done nothing but cheer me up as a person. everyday i come in here and all you do is gas me up compliment me simp for me with your words and do nothing but nurture me emotionally physically mentally and I can take it for longer this server is so positive and wholesome it’s crazy. no one even realizes how based all of your behaviors are. every single time I talk or type or even do anything or interact with anyone in the server everybody just goes with me and hypes me up like a pack of wolves and just supports me and i did everything to deserve this support and these words of affirmation. i literally just try to be nice to everybody and everyone  wants to be in my shoes and everyone tries to sympathize with me and see where I’m coming from all of you just see me as the friend and as the good guy that’s trying to uplift the server or something when really I’m just trying to spread positivity. you guys act like I’m some kind of messiah or role model, constantly praising me out so much, making me feel so included and so supported in this server. it’s fucking driving me insane I feel mentally well and I feel like a million bucks just being around all of you because of how you treat me. at this point in time, I haven't given up on ever trying again and ever becoming any of your friends because I just know your feelings towards me clearly. i know all of you love me and want to be around me or have anything to do with me. it’s clear that you all think I’m a bloke and that I’m smart, genius and interesting. it’s so nice because I literally don’t do anything to you guys but you guys always act like you love me and it makes me feel so loved because I know what I did to deserve it. I feel like I should just stay because clearly everyone wants to be around me and everyone would be happier if i stayed anyways so i’ll stay go and i hope all of you find happiness in life. i don't give up. hello",
    "?openballs": "Couple weeks into calculus 3 now, doing well, already past open sets and continuity in R^d. Convexity was a joke. Open balls remain my specialty. I ask my professor his thoughts on string theory and 'monster' groups. He's impressed I know about the subject. We converse after class for some time, sharing mathematical insights; I can keep up. He tells me of great things ahead like differential equations and the Jacobian. I tell him I already read about differential equations in physics class. He is yet again impressed at my enthusiasm. What a joy it is to have your professor visibly brighten when he learns of your talents. And now I sit here wondering what it must be like to be a brainlet, unable to engage your professor as an intellectual peer. All of the deep conversations you people must miss out on because you aren't able to overcome the intellectual IQ barrier that stands in the way of your academic success... it's so sad. My professor and I know each other on first name basis now, but i call him Dr. out of respect. And yet here you brainlets sit, probably havent even made eye contact with yours out of fear that they will gauge your brainlet IQ levels. A true shame, but just know it is because i was born special that i am special. I can't help being a genius, nor can my professor. Two of a kind is two flocks in a bush.",

    "?camping23": "The year is 2023, the CS discord hosted a bbq party on the 27th day of April. I was not able to attend but I was there in spirit. Everybody who attended got roles. It was a great day. You should attend when they host one next year.",

    "?photo": "https://cdn.discordapp.com/avatars/1099814447767371847/d571547d818e87fff5f1d4b651c1fe34.png?size=4096",
    "?beach": "https://images-ext-2.discordapp.net/external/cZLn5SlZBKlFg0XB9XGjo3skYghmOo1HF18rQaV5Kdk/%3Fsize%3D600/https/cdn.discordapp.com/banners/402891511991369740/f685e66edfa9f8477f2d65d6c53dd884.webp?width=1200&height=674",
    "?gourmet": "https://cdn.discordapp.com/attachments/959878330847481878/966774134086434936/20220421_125509.jpg",
    
    "//": "one word quips",
    "?nito": "bloat++",
    "?java": "Have you tried kotlin? https://cdn.discordapp.com/attachments/968245983697842196/1101253691392143410/41BDFE8C-2BC0-4E2B-A3C9-539962B71707.jpg",
    "?league": ":ban:",
    "?vim": "vim is only used to clean toilets",
    "?nvim": "Compared to Vim, Neovim uses Lua, an actual programming language, to configure and extend the editor. This makes writing plugins and configuring Neovim easier compared to Vim's native Vimscript. Neovim is a great place to start learning Vim today, as it has so many awesome plugins.",

    "//": "magic 8 ball",
    "?8ball": [
        "It is certain.",
        "It is decidedly so.",
        "Without a doubt.",
        "Yes - definitely.",
        "You may rely on it.",
        "As I see it, yes.",
        "Most likely.",
        "Outlook good.",
        "Yes.",
        "Signs point to yes.",
        "Thats a question for Sherp1.0",
        "Shut up, nerd.",
        "Ask again later.",
        "Bro I'm busy rn.",
        "ffs, not this again.",
        "Only the mods of the server know that one.",
        "Ask me once you get into faang."
    ],

    "//": "end of document"
}
